# for general
cask_args appdir: "/Applications"
tap "borkdude/brew"

# for GUI
cask "wezterm"
tap "koekeishiya/formulae"
brew "koekeishiya/formulae/yabai"
brew "koekeishiya/formulae/skhd"
brew "FelixKratz/formulae/borders"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "arc"
cask "obsidian"
cask "slack"
cask "raycast"

# for CLI
brew "sheldon"
brew "neovim"
brew "fzf"
brew "fd"
brew "ripgrep"
brew "git"
brew "tig"
brew "lazygit"
brew "starship"
brew "mise"
brew "gh"
brew "eza"
brew "gat"
brew "btop"
brew "jq"

# for web utils
brew "httpie"
cask "httpie"
brew "wget"

brew "docker"
brew "docker-compose"

# for Android
cask "jetbrains-toolbox"
brew "kdoctor"
